;'ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФ'
;'млллллппппллллллм  лллллллпппллллллм  ппппппппппллллллм ALPINE PLAYER V3.00'
;'лллллл    ллллллл  ллллллл   ллллллл          ппллллллл  (C) 1997          '
;'лллллл пппллллллл  лллллллппппппппп   ммммммммммллллллп by Syrius / Alpine '
;'ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФ'
;' AP 3.0 - Constants                                                           '
;'ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФ'




 _OCTAVES  dw 27392,25856,24384,23040,21696,20480,19328,18240,17216,16256,15360,14512
           dw 13696,12928,12192,11520,10848,10240, 9664, 9120, 8608, 8128, 7680, 7256
           dw  6848, 6464, 6096, 5760, 5424, 5120, 4832, 4560, 4304, 4064, 3840, 3628
           dw  3424, 3232, 3048, 2880, 2712, 2560, 2416, 2280, 2152, 2032, 1920, 1814
           dw  1712, 1616, 1524, 1440, 1356, 1280, 1208, 1140, 1076, 1016,  960,  907
           dw   856,  808,  762,  720,  678,  640,  604,  570,  538,  508,  480,  453
           dw   428,  404,  381,  360,  339,  320,  302,  285,  269,  254,  240,  226
           dw   214,  202,  190,  180,  170,  160,  151,  143,  135,  127,  120,  113
           dw   107,  101,   95,   90,   85,   80,   75,   71,   67,   63,   60,   56
           dw    53,   50,   47,   45,   42,   40,   37,   35,   33,   31,   30,   28
           dw    26,   25,   23,   22,   21,   20,   18,   17,   16,   15,   15,   14

 _VibratoTable db    0,  24,  49,  74,  97, 120, 141, 161
               db  180, 197, 212, 224, 235, 244, 250, 253
               db  255, 253, 250, 244, 235, 224, 212, 197
               db  180, 161, 141, 120,  97,  74,  49,  24





























